results/cpu-vs-latency2/redis/4-3/nsl203.out
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  30 secs]  0 threads:      602474 ops,   19963 (avg:   20082) ops/sec, 759.07KB/sec (avg: 763.14KB/sec),  0.20 (avg:  0.20) msec latency

2         Threads
2         Connections per thread
30        Seconds
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets        1825.73          ---          ---      0.19600       140.65
Gets       18256.71        11.93     18244.78      0.19500       622.50
Totals     20082.44        11.93     18244.78      0.19500       763.14


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET        -nan    100.00000
---
GET       0.057      0.00018
GET       0.058      0.00037
GET       0.059      0.00091
GET       0.060      0.00110
GET       0.061      0.00128
GET       0.062      0.00146
GET       0.063      0.00164
GET       0.064      0.00183
GET       0.065      0.00201
GET       0.066      0.00237
GET       0.067      0.00292
GET       0.068      0.00383
GET       0.069      0.00420
GET       0.070      0.00475
GET       0.071      0.00548
GET       0.072      0.00676
GET       0.073      0.00822
GET       0.074      0.01059
GET       0.075      0.01278
GET       0.076      0.01588
GET       0.077      0.01935
GET       0.078      0.02118
GET       0.079      0.02337
GET       0.080      0.02793
GET       0.081      0.02921
GET       0.082      0.03305
GET       0.083      0.03761
GET       0.084      0.04345
GET       0.085      0.04948
GET       0.086      0.05423
GET       0.087      0.06263
GET       0.088      0.06938
GET       0.089      0.07632
GET       0.090      0.08527
GET       0.091      0.09732
GET       0.092      0.10827
GET       0.093      0.12854
GET       0.094      0.15812
GET       0.095      0.18495
GET       0.096      0.20376
GET       0.097      0.22238
GET       0.098      0.24265
GET       0.099      0.26146
GET       0.100      0.34836
GET       0.110      0.54354
GET       0.120      1.15355
GET       0.130      2.97242
GET       0.140      4.76993
GET       0.150      5.55649
GET       0.160      6.52745
GET       0.170      9.40092
GET       0.180     18.52321
GET       0.190     47.66771
GET       0.200     74.22138
GET       0.210     87.40976
GET       0.220     94.11925
GET       0.230     97.29324
GET       0.240     98.64178
GET       0.250     99.20084
GET       0.260     99.45445
GET       0.270     99.58463
GET       0.280     99.65748
GET       0.290     99.69454
GET       0.300     99.72029
GET       0.310     99.74165
GET       0.320     99.76867
GET       0.330     99.79734
GET       0.340     99.81139
GET       0.350     99.82381
GET       0.360     99.83860
GET       0.370     99.85686
GET       0.380     99.88443
GET       0.390     99.90761
GET       0.400     99.93555
GET       0.410     99.95509
GET       0.420     99.97024
GET       0.430     99.98046
GET       0.440     99.98795
GET       0.450     99.99124
GET       0.460     99.99434
GET       0.470     99.99635
GET       0.480     99.99708
GET       0.490     99.99763
GET       0.500     99.99817
GET       0.540     99.99854
GET       0.550     99.99872
GET       0.560     99.99927
GET       0.590     99.99945
GET       0.610     99.99982
GET       0.630    100.00000